{
    "experiences": [
        {
            "role": "Front-end Developer", 
            "name": "Kinetic", 
            "date": "jul 2020 - present", 
            "highlights": "At Kinetic I help with all-things front-end, working mostly with React and Redux. Kinetic’s dashboards offer data insights into their wearable devices as well as allow users to handle all related admin tasks. Most of my work has been centered around feature development for social-distancing protocols related to Covid-19.",
            "tools": ["React", "Redux"], 
            "link": "https://wearkinetic.com"
        }, 
        {
            "role": "Software Engineer",
            "name": "Ride Health",
            "date": "sep 2017 - jun 2020",
            "description": "Ride Health improves access to care for the 3.6 million low-income, elderly and disabled patients who face transportation barriers. Missed appointments cause billions in lost revenue for providers, lower health status for patients, and high downstream costs for payers. Ride Health improves patients' and coordinators' experiences, reduces no-shows and delayed discharges, and avoids hospital visits through improved engagement and compliance.",
            "tools": [
                "Elixir",
                "React",
                "Typescript",
                "NOSQL",
                "GCP",
                "Twilio"
            ],
            "link": "https://ride-health.com",
            "highlights": [
                "I started as a junior on a team of two. As the company grew from four to 25 employees, my responsibilities grew to include full-stack development and feature architecture. The product was a robust real-time system that included scheduling, notifications, billing, fleet selection, and much more for non-emergency medical transportation. We used React and Typescript on the front-end and Elixir for the back-end. My largest contribution was an IVR system that exposed much of our application’s functionality including read-time ride-hailing. The IVR system eventually reduced our inbound customer support phone calls by over 80%. "
            ],
            "location": "New York"
        },
        {
            "role": "Web Developer",
            "name": "Authorea",
            "date": "aug 2016 - aug 2017",
            "description": " As a web-developer at Authorea my first task was rebuilding their landing site according to new designs. The new designs were accompanied by a migration off of Bootstrap and into custom components and style guides. I spent the bulk of my remaining building front-end features for Authorea’s core product, a web-editor similar to google docs. Most of this work was done in React and Redux, using Ruby on Rails on the back-end.",
            "tools": [
                "Ruby",
                "Rails",
                "Redux",
                "React",
                "Sass/CSS",
                "HTML"
            ],
            "link": "https://authorea.com",
            "highlights": [
                "As a web-developer at Authorea my first task was rebuilding their landing site according to new designs. The new designs were accompanied by a migration off of Bootstrap and into custom components and style guides. I spent the bulk of my remaining building front-end features for Authorea’s core product, a web-editor similar to google docs. Most of this work was done in React and Redux, using Ruby on Rails on the back-end."
            ],
            "location": "New York"
        },
        {
            "role": "Web Development Intern",
            "name": "Oak Studios",
            "description": "Oak is an independent design-led product studio based in cloudy Brooklyn, New York. We make creative products like Dropmark and Siteleaf, and work on a number of other ventures.",
            "tools": [
                "Ruby",
                "Rails",
                "Jekyll",
                "Javascript",
                "HTML",
                "SASS/CSS"
            ],
            "link": "https://oak.is",
            "date": "feb 2016 - may 2016",
            "highlights": [
                "Interning at Oak was my first exposure to professional development, including code reviews, bug fixes, issue tracking, and much more. My biggest contribution was building the http://freelancer.creativemornings.com/ website from scratch. I also wrote some small fixes for https://workingnotworking.com/ and other Oak clients. We used the static-site generator Jekyll for most of the front-end work, and Ruby on Rails on the backend."
            ],
            "location": "New York"
        }
    ],
    "schooling": [
        {
            "role": "Web Dev Immersive",
            "name": "General Assembly",
            "highlights": [
                "This was a 12-week web-development intensive. Classes were held from 9-5pm everyday with around four hours ago homework each night. I chose GA because all of the learning is hands-on. We built everything from simple javascript scripts to full web applications. We learned the basics of version control, agile, and web development. My final project was a music recommendation interface that, using D3, displayed a never-ending stream of related musical artists."
            ],
            "tools": [
                "Ruby on Rails",
                "Angular",
                "MongoDB",
                "Sinatra",
                "Node"
            ],
            "link": "https://generalassemb.ly",
            "date": "jul 2015 - oct 2015"
        },
        {
            "role": "Bachelor's in Music",
            "name": "NYU",
            "quote": "NYU Jazz provides aspiring students advanced performance training combined with the finest related academic and music courses designed to encourage entrepreneurship.",
            "highlights": [
                "I came to NYU with the single focus of becoming a professional musician. Throughout my four years I was lucky to study with some of the best musicians in the world, including Billy Hart (in Miles Davis’s band), Pablo Rieppi (NYC Opera and NYC Philharmonic), and Lenny White (also in Miles Davis’s band). The experience taught me that I loved the tinkering, exploratory craftsmanship of music but was not cut out for the intensely social, travel-intensive lifestyle. Luckily I was able to find this same passion in programming."
            ],
            "link": "https://nyu.edu",
            "date": "sep 2011 - may 2015"
        }
    ],
    "contact": [
        {
            "name": "mail@alanrice.me",
            "link": "mailto:mail@alanrice.me",
            "display": "mail@alanrice.me",
        },
        {
            "name": "LinkedIn",
            "display": "linkedin.com/in/alanricecode",
            "link": "https://www.linkedin.com/in/alanricecode/",
        },
        {
            "name": "AngelList",
            "display": "linkedin.com/in/alanricecode",
            "link": "https://angel.co/alan-rice",
        },
        {
            "name": "Github",
            "display": "github.com/AlanRice93",
            "link": "https://github.com/AlanRice93",
        },
        {
            "name": "Twitter",
            "display": "https://twitter.com/Alan__Rice",
            "link": "https://twitter.com/Alan__Rice",
        }
    ]
}