[{
  "role": "Web Developer",
  "name": "Authorea",
  "date": "8.20.2016 - present",
  "description": "I work across the stack developing new features for a real-time collaborative online document editor.",
  "tech": ["Ruby on Rails", "React", "Redux", "Sass"],
  "link": "https://authorea.com",
}, {
  "role": "Web Development Intern",
  "name": "Oak",
  "description": "I built client websites from scratch using Oak's in-house CMS Siteleaf. Also added additional features to WorkingNotWorkng, a Webby-award-winning freelancing site.",
  "tech": ["Ruby on Rails", "Siteleaf", "Jekyll"],
  "link": "https://oak.is",
  "date": "2.15.2016 - 5.15.2016"
}, {
  "role": "Web Developmentent Immersive",
  "name": "General Assembly",
  "description": "Full-time 12 week course in web-development. Built several web applications from scratch across different stacks using Agile and Version Control.",
  "tech": ["Ruby on Rails", "Angular", "MongoDB", "Sinatra", "Node"],
  "link": "https://generalassemb.ly",
  "date": "7.15.2015 - 10.20.2015"
}, {
  "role": "Bachelor\'s in Music",
  "name": "NYU",
  "quote": "NYU Jazz provides aspiring students advanced performance training combined with the finest related academic and music courses designed to encourage entrepreneurship.",
  "description": "Completed 4 year undergraduate music performance program. Took several additional programming courses in the CS department.",
  "link": "https://nyu.edu",
}, {
  "name": "HackerNews Bot",
  "link": "https://github.com/AlanRice93/hacker_news_slack_bot",
  "description": "Slackbot written in the Rust framework Iron. Uses node to monitor Slack channels and scrapes HackerNews and returns the top 5 links whenever HackerNews is mentioned. Second project completed in Rust.",
  "tech": ["Rust", "Iron", "Node", "Axios", "Express"],
}, {
  "name": "Zot",
  "link": "https://github.com/AlanRice93/zot",
  "description": "Slackbot written in Node. Example actions include a Spotify song player and word alert system. Additional actions can be easily added.",
  "tech": ["Node", "Axios", "Express"],
}, {
  "name": "SpotOn",
  "link": "https://github.com/AlanRice93/SpotOn",
  "description": "Final project at General Assembly, written using JS from the front to the back (MEAN Stack). Visually represents connections between artists on Spotify using D3.js",
  "tech": ["Node", "Angular", "MongoDB", "Express"],
}]
